fn-bidtravel-pnrfinisher-pnrretriever-dev/fn-bidtravel-pnrfinisher-pnrretriever-dev/ENS Event.xml

<?xml version="1.0" encoding="UTF-8"?><soap-env:Envelope xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:swse="http://wse.sabre.com/eventing" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing"><soap-env:Header><eb:MessageHeader eb:version="1.0" soap-env:mustUnderstand="1"><wse:MySubscription>7SVG</wse:MySubscription><swse:EventTopic>WSE.QUEUE.PSS.SABREQUEUE</swse:EventTopic></eb:MessageHeader><wsa:Action>http://wse.sabre.com/EventSource/notification</wsa:Action><wsa:MessageID>wsevlc202c49a90a9-6da7-4625-ab29-9f5034535eac</wsa:MessageID><wse:Identifer>9de80141-58ac-4993-b09f-a6793ae974f6</wse:Identifer><wsa:To>https://apim-bidtravel-dev.azure-api.net/ENS/PNR/Queue</wsa:To></soap-env:Header><soap-env:Body><swse:QueueElem><swse:UniqueId>TNRYPR</swse:UniqueId><swse:PartitionCode>AA</swse:PartitionCode><swse:PCC>7SVG</swse:PCC><swse:QueueNo>498</swse:QueueNo><swse:PrefactoryCode>TICKETING ARRANGEMENT                             </swse:PrefactoryCode><swse:QueueDepth>0001</swse:QueueDepth></swse:QueueElem></soap-env:Body></soap-env:Envelope>